In [2]:
import warnings
warnings.filterwarnings("ignore")
import pandas as pd
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df['experience'] = df['experience'].fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
from word2number import w2n
df['experience'] = df['experience'].apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [27]:
mean=df['test_score(out of 10)'].mean()
print(mean)

7.857142857142857

In [28]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(mean)
print(df)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [29]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [30]:
X=df.drop(columns=['salary($)'])
Y=df['salary($)']

In [31]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2)

In [32]:
print(X_train.shape)
print(X_test.shape)

(6, 3)
(2, 3)

In [33]:
print(Y_train.shape)
print(Y_test.shape)

(6,)
(2,)

In [34]:
model=LinearRegression()
model.fit(X_train,Y_train)
ans=model.predict(X_test)
print(ans)

[42176.43647849 63274.24974734]

In [ ]:
n=int(input("Enter n"))
for i in range(n):
    expe=int(input("Enter Experience:"))
    test=int(input("Enter testscore:"))
    inte=int(input("Enter score:"))
    ans=model.predict([[expe,test,inte]])
    print(ans)

Enter n 2